hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v1/TAL_AENDERUNG_LAE_01/VZM.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
    xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v1" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>LAE</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallart>Aenderung</geschaeftsfallart>
            </order>
            <message>
                <VZM>
                    <meldungsattribute>
                        <vertragsnummer>${contractId}</vertragsnummer>
                        <externeAuftragsnummer>${externalOrderId}</externeAuftragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                        <kundennummerBesteller>${3rdPartySalesmanCustomerId}</kundennummerBesteller>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0071</meldungscode>
                            <meldungstext>Die Bearbeitung des Auftrags erfordert detailiertere Recherchen, die die Bearbeitungszeit verlängern können</meldungstext>
                        </position>
                    </meldungspositionen>
                </VZM>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
